ThisIsNotRocketScience/Syntonovo_PAN/controller/pan_sh/board/pin_mux.h
/*! @name PIO1_26 (number 63), SLATCH2
  @{ */
#define BOARD_INITPINS_SLATCH2_PERIPHERAL GPIO                    /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_SLATCH2_SIGNAL PIO1                        /*!<@brief GPIO signal: PIO1 */
#define BOARD_INITPINS_SLATCH2_GPIO GPIO                          /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SLATCH2_GPIO_PIN 26U                       /*!<@brief PIO1 pin index: 26 */
#define BOARD_INITPINS_SLATCH2_PORT 1U                            /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_SLATCH2_PIN 26U                            /*!<@brief 1U pin index: 26 */
#define BOARD_INITPINS_SLATCH2_CHANNEL 26                         /*!<@brief GPIO PIO1 channel: 26 */
#define BOARD_INITPINS_SLATCH2_PIN_NAME PIO1_26                   /*!<@brief Pin name */
#define BOARD_INITPINS_SLATCH2_LABEL "SLATCH2"                    /*!<@brief Label */
#define BOARD_INITPINS_SLATCH2_NAME "SLATCH2"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_SLATCH2_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PIO0_13 (number 67), SLATCH1
  @{ */
#define BOARD_INITPINS_SLATCH1_PERIPHERAL GPIO                    /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_SLATCH1_SIGNAL PIO0                        /*!<@brief GPIO signal: PIO0 */
#define BOARD_INITPINS_SLATCH1_GPIO GPIO                          /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SLATCH1_GPIO_PIN 13U                       /*!<@brief PIO0 pin index: 13 */
#define BOARD_INITPINS_SLATCH1_PORT 0U                            /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_SLATCH1_PIN 13U                            /*!<@brief 0U pin index: 13 */
#define BOARD_INITPINS_SLATCH1_CHANNEL 13                         /*!<@brief GPIO PIO0 channel: 13 */
#define BOARD_INITPINS_SLATCH1_PIN_NAME PIO0_13                   /*!<@brief Pin name */
#define BOARD_INITPINS_SLATCH1_LABEL "SLATCH1"                    /*!<@brief Label */
#define BOARD_INITPINS_SLATCH1_NAME "SLATCH1"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_SLATCH1_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PIO0_18 (number 72), EIN_EXT
  @{ */
#define BOARD_INITPINS_EIN_EXT_PERIPHERAL GPIO                   /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_EIN_EXT_SIGNAL PIO0                       /*!<@brief GPIO signal: PIO0 */
#define BOARD_INITPINS_EIN_EXT_GPIO GPIO                         /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_EIN_EXT_GPIO_PIN 18U                      /*!<@brief PIO0 pin index: 18 */
#define BOARD_INITPINS_EIN_EXT_PORT 0U                           /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_EIN_EXT_PIN 18U                           /*!<@brief 0U pin index: 18 */
#define BOARD_INITPINS_EIN_EXT_CHANNEL 18                        /*!<@brief GPIO PIO0 channel: 18 */
#define BOARD_INITPINS_EIN_EXT_PIN_NAME PIO0_18                  /*!<@brief Pin name */
#define BOARD_INITPINS_EIN_EXT_LABEL "EIN_EXT"                   /*!<@brief Label */
#define BOARD_INITPINS_EIN_EXT_NAME "EIN_EXT"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_EIN_EXT_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PIO0_29 (number 82), CODEC_INT
  @{ */
#define BOARD_INITPINS_FC3_INT_PERIPHERAL GPIO                   /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_FC3_INT_SIGNAL PIO0                       /*!<@brief GPIO signal: PIO0 */
#define BOARD_INITPINS_FC3_INT_GPIO GPIO                         /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_FC3_INT_GPIO_PIN 29U                      /*!<@brief PIO0 pin index: 29 */
#define BOARD_INITPINS_FC3_INT_PORT 0U                           /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_FC3_INT_PIN 29U                           /*!<@brief 0U pin index: 29 */
#define BOARD_INITPINS_FC3_INT_CHANNEL 29                        /*!<@brief GPIO PIO0 channel: 29 */
#define BOARD_INITPINS_FC3_INT_PIN_NAME PIO0_29                  /*!<@brief Pin name */
#define BOARD_INITPINS_FC3_INT_LABEL "CODEC_INT"                 /*!<@brief Label */
#define BOARD_INITPINS_FC3_INT_NAME "FC3_INT"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_FC3_INT_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PIO1_16 (number 88), LED
  @{ */
#define BOARD_INITPINS_LED_PERIPHERAL GPIO                    /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_LED_SIGNAL PIO1                        /*!<@brief GPIO signal: PIO1 */
#define BOARD_INITPINS_LED_GPIO GPIO                          /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LED_GPIO_PIN 16U                       /*!<@brief PIO1 pin index: 16 */
#define BOARD_INITPINS_LED_PORT 1U                            /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_LED_PIN 16U                            /*!<@brief 1U pin index: 16 */
#define BOARD_INITPINS_LED_CHANNEL 16                         /*!<@brief GPIO PIO1 channel: 16 */
#define BOARD_INITPINS_LED_PIN_NAME PIO1_16                   /*!<@brief Pin name */
#define BOARD_INITPINS_LED_LABEL "LED"                        /*!<@brief Label */
#define BOARD_INITPINS_LED_NAME "LED"                         /*!<@brief Identifier name */
#define BOARD_INITPINS_LED_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                              /* @} */

/*! @name PIO1_11 (number 94), SELINHG
  @{ */
#define BOARD_INITPINS_SELINHG_PERIPHERAL GPIO                    /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_SELINHG_SIGNAL PIO1                        /*!<@brief GPIO signal: PIO1 */
#define BOARD_INITPINS_SELINHG_GPIO GPIO                          /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SELINHG_GPIO_PIN 11U                       /*!<@brief PIO1 pin index: 11 */
#define BOARD_INITPINS_SELINHG_PORT 1U                            /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_SELINHG_PIN 11U                            /*!<@brief 1U pin index: 11 */
#define BOARD_INITPINS_SELINHG_CHANNEL 11                         /*!<@brief GPIO PIO1 channel: 11 */
#define BOARD_INITPINS_SELINHG_PIN_NAME PIO1_11                   /*!<@brief Pin name */
#define BOARD_INITPINS_SELINHG_LABEL "SELINHG"                    /*!<@brief Label */
#define BOARD_INITPINS_SELINHG_NAME "SELINHG"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_SELINHG_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
